## Terraform Plan for Staging Environment

**Environment**: Staging
**Branch**: develop
**Triggered by**: PR #11
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.database.aws_db_instance.database will be created
  + resource "aws_db_instance" "database" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "tfplayground"
      + db_subnet_group_name                  = "staging-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "staging-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Name" = "staging-database"
        }
      + tags_all                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + timezone                              = (known after apply)
      + username                              = "tfplayground_user"
      + vpc_security_group_ids                = [
          + "sg-04ae53f8cd577a07d",
        ]
    }

  # module.secrets.aws_secretsmanager_secret_version.db_credentials[0] must be replaced
-/+ resource "aws_secretsmanager_secret_version" "db_credentials" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/staging/database/credentials-v4f7-wbnm9s" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/staging/database/credentials-v4f7-wbnm9s|terraform-20250623180708810300000002" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20250623180708810300000002" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.secrets.random_password.db_password[0] must be replaced
+/- resource "random_password" "db_password" {
      ~ bcrypt_hash = (sensitive value)
      ~ id          = "none" -> (known after apply)
      ~ result      = (sensitive value)
      ~ special     = true -> false # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.webserver.data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            
            # Update system packages
            yum update -y
            
            # Install required packages
            yum install -y python3 python3-pip git mariadb1011-client-utils
            
            # Create application directory
            mkdir -p /var/www/webapp
            cd /var/www/webapp
            
            # Create Python virtual environment
            python3 -m venv venv
            source venv/bin/activate
            
            # Install required Python packages
            pip install flask mysql-connector-python
            
            # Create application files
            cat > app.py << 'EOF'
            from flask import Flask, jsonify
            import mysql.connector
            import os
            
            app = Flask(__name__)
            
            # Database configuration
            db_config = {
                'host': '${db_host}',
                'user': '${db_user}',
                'password': '${db_password}',
                'database': '${db_name}'
            }
            
            def get_db_connection():
                return mysql.connector.connect(**db_config)
            
            @app.route('/')
            def index():
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor(dictionary=True)
                    cursor.execute('SELECT * FROM contacts')
                    contacts = cursor.fetchall()
                    cursor.close()
                    conn.close()
                    return jsonify(contacts)
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            @app.route('/health')
            def health():
                return jsonify({'status': 'healthy'})
            
            if __name__ == '__main__':
                app.run(host='0.0.0.0', port=8080)
            EOF
            
            # Create systemd service file
            cat > /etc/systemd/system/webapp.service << 'EOF'
            [Unit]
            Description=Python Web Application
            After=network.target
            
            [Service]
            User=root
            WorkingDirectory=/var/www/webapp
            Environment="PATH=/var/www/webapp/venv/bin"
            ExecStart=/var/www/webapp/venv/bin/python app.py
            Restart=always
            
            [Install]
            WantedBy=multi-user.target
            EOF
            
            # Start and enable the service
            systemctl daemon-reload
            systemctl start webapp
            systemctl enable webapp
        EOT
      + vars     = {
          + "db_host"     = (known after apply)
          + "db_name"     = "tfplayground"
          + "db_password" = (sensitive value)
          + "db_user"     = (sensitive value)
        }
    }

  # module.webserver.aws_eip.webserver will be created
  + resource "aws_eip" "webserver" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "staging-webserver-eip"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-webserver-eip"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc                  = (known after apply)
    }

  # module.webserver.aws_instance.webserver will be created
  + resource "aws_instance" "webserver" {
      + ami                                  = "ami-06c8f2ec674c67112"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "staging-webserver-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "tf-playground-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-04d1f8a2aee9a753c"
      + tags                                 = {
          + "Name" = "staging-webserver"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-webserver"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0a1d4decda7df4a01",
        ]

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + database_endpoint            = (known after apply)
  + webserver_instance_id        = (known after apply)
  + webserver_public_ip          = (known after apply)

  ```
  
  </details>